---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtrusionRoof
source: html/a31bef94-c6c3-5126-54b5-ecfb764fc3cb.htm
---
# ExtrusionRoof Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.